{
  "shortDescription": "Discover and share slackline spots worldwide with the ultimate community-driven mapping app. Built by slackliners, for slackliners.",
  "longDescription": "<p class='mb-4'><strong>Discover and share slackline spots worldwide with the ultimate community-driven mapping app.</strong></p><p class='mb-4'>SlackMap transforms how you discover slackline spots. Browse an interactive map filled with community-contributed locations, from urban parklines to epic highlines. Each spot shows real ratings, reviews, and details from fellow slackliners who've been there.</p><p class='mb-4'><strong>Key Features</strong></p><p class='mb-4'><strong>INTERACTIVE MAP DISCOVERY</strong><br>- Explore slackline locations worldwide<br>- Save your favourite spots<br>- Get details and directions instantly</p><p class='mb-4'><strong>COMMUNITY REVIEWS & RATINGS</strong><br>- Rate locations -5 to +5 with detailed reviews<br>- Read honest feedback from fellow slackliners<br>- Share your experiences</p><p class='mb-4'><strong>ADD YOUR OWN SPOTS</strong><br>- Easily add locations by selecting two anchor points<br>- Categorise by slackline type<br>- Keep private or share with the community</p><p class='mb-4'><strong>CONNECT & FOLLOW</strong><br>- Follow other slackliners<br>- Save favourite locations<br>- Build your network</p><p class='mb-4'><strong>PRIVACY CONTROLS</strong><br>- Private or public location sharing<br>- Secure Apple Sign-In</p><p class='mb-4'><strong>PERFECT FOR</strong><br>- Beginners discovering their first slackline spots<br>- Experienced slackliners sharing hidden gems<br>- Travelers finding spots in new cities<br>- Local communities building their slackline scene</p><p class='mb-4'><strong>Why SlackMap?</strong></p><p class='mb-4'>Built by slackliners, for slackliners. We understand the unique needs of our community - from finding the perfect parkline setup to discovering that epic highline spot. Every feature is designed to enhance your slackline journey and help you connect with spots and people who share your passion.</p><p class='mb-4'>Join the community that's mapping the world's slackline spots, one location at a time.</p>"
}
