{
  "appId": "haptic-vibration-timer",
  "title": "Terms of Use (Haptic Vibration Timer)",
  "sections": [
    {
      "heading": "TL;DR (Too Long; Didn't Read)",
      "content": [
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Agreement:</strong> By using Haptic Vibration Timer, you agree to follow these Terms. If you don't agree, please don't use the app.</li>",
        "<li><strong>Use:</strong> The App is provided for personal, non-commercial use only.</li>",
        "<li><strong>Privacy:</strong> The App does not collect any personal data. See our <a href=\"https://cumuluscoding.com/policy.html?app=haptic-vibration-timer&type=privacy-policy\" class=\"text-primary hover:text-blue-600 underline\">Privacy Policy</a>.</li>",
        "<li><strong>Liability:</strong> The App is provided \"as is.\" We're not liable for damages beyond what you've paid to use the app.</li>",
        "<li><strong>Changes:</strong> We may update these Terms. Continuing to use the App means you accept the changes.</li>",
        "</ul>",
        "<p class=\"mb-4\">This summary doesn't replace the full Terms—read the full text for complete details.</p>"
      ]
    },
    {
      "heading": "Introduction",
      "content": [
        "<p class=\"mb-4\">These Terms of Use govern your use of the Haptic Vibration Timer application. By using the App, you agree to these terms.</p>",
        "<p class=\"mb-4\">The App is a simple timer application that operates entirely on your device (iPhone and Apple Watch) without collecting or transmitting any data.</p>",
        "<p class=\"mb-4\">If you have questions about these Terms, <a href=\"mailto:hello@cumuluscoding.com?subject=Haptic%20Vibration%20Timer%20-%20Your%20Subject\" class=\"text-primary hover:text-blue-600 underline\">contact us</a>.</p>"
      ]
    },
    {
      "heading": "Acceptance of Terms",
      "content": [
        "<p class=\"mb-4\">By downloading, installing, or using the App, you accept and agree to be bound by these Terms of Use.</p>"
      ]
    },
    {
      "heading": "Use of the App",
      "content": [
        "<p class=\"mb-4\">The App is provided for personal, non-commercial use only. You may not:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>Use the App for any illegal purpose</li>",
        "<li>Attempt to reverse engineer the App</li>",
        "<li>Distribute copies of the App without permission</li>",
        "</ul>"
      ]
    },
    {
      "heading": "Intellectual Property",
      "content": [
        "<p class=\"mb-4\">The App and all related software, designs, text, and graphics are owned by us or our licensors and are protected by intellectual property laws. Except for the limited licence above, <strong>no rights</strong> are granted to you. Apple, iOS, watchOS, and other Apple marks are trademarks of Apple Inc.</p>"
      ]
    },
    {
      "heading": "Pricing, Payment & Refunds",
      "content": [
        "<p class=\"mb-4\">The App is a paid download available through the Apple App Store. Payment processing (including taxes/VAT and currency conversion) is handled by Apple; we do not process payments or collect your payment details. There are <strong>no subscriptions or in-app purchases</strong>.</p>",
        "<p class=\"mb-4\"><strong>Refunds and cooling-off:</strong> Refunds (including any statutory right of withdrawal for digital content) are administered by Apple under the App Store's policies. To request a refund, contact Apple via https://reportaproblem.apple.com.  We cannot issue refunds directly.</p>",
        "<p class=\"mb-4\"><strong>App Store terms & licence:</strong> Your purchase and use of the App are also governed by Apple's terms, including the Apple Media Services terms and Apple's Standard Licensed Application End User Licence Agreement. If there is any conflict between these Terms and Apple's terms regarding purchase, payment, or licensing, Apple's terms apply.</p>",
        "<p class=\"mb-4\"><strong>Price changes:</strong> We may change the price of the App for future purchases at any time. Price changes do not affect purchases already completed, and we do not offer price adjustments or credits for past purchases.</p>"
      ]
    },
    {
      "heading": "Privacy",
      "content": [
        "<p class=\"mb-4\">Your privacy is important to us. Please review our Privacy Policy to understand how we handle your information.</p>"
      ]
    },
    {
      "heading": "Disclaimer",
      "content": [
        "<p class=\"mb-4\">The App is provided \"as is\" without warranties of any kind. We are not responsible for any damages arising from your use of the App.</p>"
      ]
    },
    {
      "heading": "Termination",
      "content": [
        "<p class=\"mb-4\">We may suspend or terminate your access to the App at any time if you breach these Terms, if required by law, or if we withdraw or materially change the App. You may stop using and uninstall the App at any time. Upon termination, the licence granted to you ends and you must cease use.</p>"
      ]
    },
    {
      "heading": "Governing Law and Jurisdiction",
      "content": [
        "<p class=\"mb-4\">These Terms and any dispute or claim arising out of or in connection with them are governed by the laws of <strong>England and Wales</strong>, and the courts of <strong>England and Wales</strong> shall have exclusive jurisdiction. If you are a consumer in another country, you may have mandatory rights under your local laws which remain unaffected.</p>"
      ]
    },
    {
      "heading": "Changes to These Terms",
      "content": [
        "<p class=\"mb-4\">We may update these Terms from time to time. Changes will be effective when posted or when the App notifies you. The \"Last updated\" date at the top will reflect the most recent version. If you continue to use the App after changes take effect, you agree to the updated Terms.</p>"
      ]
    },
    {
      "heading": "Contact Us",
      "content": [
        "<p class=\"mb-4\">If you have questions about this policy or the app, please contact:</p>",
        "<p class=\"mb-4\"><strong>Email:</strong> <a href=\"mailto:hello@cumuluscoding.com?subject=Haptic%20Vibration%20Timer%20-%20Your%20Subject\" class=\"text-primary hover:text-blue-600 underline\">hello@cumuluscoding.com</a></p>",
        "<p class=\"mb-4\">When emailing us, please include the app name first, followed by your subject in the email's subject line.</p>",
        "<p class=\"mb-4\">For example: <code class='bg-gray-100 px-1 py-0.5 rounded text-sm'>Haptic Vibration Timer - [Your Subject Here]</code></p>"
      ]
    }
  ],
  "metadata": {
    "version": "1.0.0",
    "lastUpdated": "2025-12-14",
    "effectiveDate": "2025-12-14",
    "locale": "en-GB"
  }
}
