{
  "appId": "slackmap",
  "title": "Privacy Policy (SlackMap)",
  "sections": [
    {
      "heading": "TL;DR (Too Long; Didn’t Read)",
      "content": [
        "<p class=\"mb-4\">This summary gives you the key points of our Privacy Policy in plain language. It does <strong>not</strong> replace the full policy, which you should read for complete details about how your data is handled.</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Data Storage:</strong> SlackMap uses <strong>Firebase’s Cloud Firestore</strong> to store all data, including:</li>",
        "<li><strong>Private user data</strong> such as personal locations, settings, and details.</li>",
        "<li><strong>Shared community data</strong> such as locations, reviews, and related content.</li>",
        "<li>Some <strong>simple settings</strong> may also be stored locally on your device.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Personal Data Handling:</strong></li>",
        "<li><strong>Sign in with Apple</strong> is the only authentication method.</li>",
        "<li><strong>Firebase</strong> stores the <strong>email address</strong> you share through Apple Sign-In (this may be your real address or Apple’s private relay address).</li>",
        "<li>The only identifier used across the project is the <strong>UID</strong> generated by Firebase.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Community Data Ownership:</strong></li>",
        "<li>Once <strong>location data</strong> is <strong>shared and interacted with by the community</strong> (e.g., through reviews or favourites), it becomes <strong>community-owned</strong>.</li>",
        "<li><strong>Community-owned data cannot be deleted</strong> by the original contributor, as this preserves the shared value and continuity of the community.</li>",
        "</ul>"
      ]
    },
    {
      "heading": "Introduction",
      "content": [
        "<p class=\"mb-4\">Welcome to <strong>SlackMap</strong>. This Privacy Policy explains how we collect, use, share, and protect your personal information when you use our application (hereafter referred to as \"<strong>the App</strong>\").</p>",
        "<p class=\"mb-4\">The App is a community-driven platform for sharing and discovering slackline locations. To provide this service, we use Firebase’s Cloud Firestore to store user-submitted data such as private locations, public locations, settings, and reviews. Certain non-sensitive preferences may also be stored locally on your device to support core functionality.</p>",
        "<p class=\"mb-4\">User accounts are managed via <strong>Firebase Authentication</strong> using <strong>Sign in with Apple</strong>. Firebase securely stores the <strong>email address</strong> you provide through Apple Sign-In (which may be your real email or Apple’s private relay address). We use the <strong>unique user identifier (UID)</strong> generated by Firebase as the sole identifier for associating data with individual users. <strong>No passwords or other persistent identifiers are stored or used by the App.</strong></p>",
        "<p class=\"mb-4\">We are committed to safeguarding your privacy and aim to be transparent about how your data is handled. By using the App, you agree to the terms outlined in this Privacy Policy.</p>"
      ]
    },
    {
      "heading": "Collection of Personal Data",
      "content": [
        "<p class=\"mb-4\">The App collects and processes certain types of data in order to function and provide its community features. The App distinguishes between <strong>personal data</strong> (information that can be linked to an individual) and <strong>community data</strong> (shared content intended for public contribution and use).</p>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Personal Data</h3></p>",
        "<p class=\"mb-4\">The following types of personal data may be collected:</p>",
        "<p class=\"mb-4\"><strong>Authentication Information</strong>: When a user creates an account, Firebase Authentication uses <strong>Sign in with Apple</strong>. Firebase securely stores the <strong>email address provided by Apple</strong> (which may be the user’s real email or a private relay address) and manages the authentication process—<strong>no passwords are collected or stored by SlackMap</strong>.</p>",
        "<p class=\"mb-4\"><strong>Unique Identifier (UID)</strong>: Each user is assigned a UID by Firebase. This is used internally throughout the App to associate a user with their actions, such as saving locations or submitting reviews.</p>",
        "<p class=\"mb-4\"><strong>Username</strong>: Upon sign-up, each user is automatically assigned a unique username, which also serves as their display name. This username may be shown publicly when the user contributes content. Users may choose to update their username through the account settings.</p>",
        "<p class=\"mb-4\"><strong>App Settings and Preferences</strong>: Some user preferences or lightweight settings may be stored locally on the device or within Firebase.</p>",
        "<p class=\"mb-4\">This information is collected only to enable core functionality of the App and to associate users with their contributions.</p>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Community Data</h3></p>",
        "<p class=\"mb-4\">The App allows users to contribute location-based information such as slackline locations and reviews. When a location is made public and other users interact with it (for example, by favouriting or reviewing it), that location can no longer be deleted or made private by the original creator. However, the creator may still update certain attributes, such as the location’s name.</p>",
        "<p class=\"mb-4\">Users are able to create, edit, and delete their own reviews at any time. Reviews consist of a title, comments, and a score, and remain fully manageable by their authors until the point of account deletion.</p>",
        "<p class=\"mb-4\">When a user deletes their account, public locations and reviews associated with them will be retained but anonymised, with personal identifiers such as usernames and UIDs removed or replaced with generic labels to protect user privacy. Specific details on how user content is handled upon account deletion are outlined in the <a href=\"#data-retention\" class=\"text-primary hover:text-blue-600 underline\">Data Retention</a> section.</p>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Balancing Privacy and Community Value</h3></p>",
        "<p class=\"mb-4\">This approach to community data balances individual user privacy with the need to preserve the shared value and continuity of the App. By distinguishing between personal data and community data, the App ensures that users’ private information is protected while allowing valuable contributions to remain accessible and useful for the broader community. This distinction is fundamental to maintaining a collaborative platform where shared locations and reviews enrich the experience for all users.</p>"
      ]
    },
    {
      "heading": "Use of Personal Data",
      "content": [
        "<p class=\"mb-4\">The personal data collected by the App is used solely to provide, maintain, and improve the service, as well as to enable user interaction within the SlackMap community. Specifically, personal data is used for the following purposes:</p>",
        "<p class=\"mb-4\"><strong>Account Creation and Authentication</strong>: To securely create and manage user accounts, including verifying identity during login through Firebase Authentication.</p>",
        "<p class=\"mb-4\"><strong>User Identification and Personalisation</strong>: To associate user-generated content such as saved locations, reviews, and preferences with individual users, enabling a personalised experience within the App.</p>",
        "<p class=\"mb-4\"><strong>Communication</strong>: To send important notifications regarding your account, service updates, or changes to our policies—including the Privacy Policy, <a href=\"https://cumuluscoding.com/policy.html?app=slackmap&type=terms-of-use\" class=\"text-primary hover:text-blue-600 underline\">Terms of Use</a>, or other relevant service information. We do not use personal data for marketing purposes unless you have explicitly consented.</p>",
        "<p class=\"mb-4\"><strong>Security and Fraud Prevention</strong>: To detect, prevent, and respond to fraudulent or unauthorised activities, ensuring the safety and integrity of the App and its users.</p>",
        "<p class=\"mb-4\"><strong>Analytics and Improvement</strong>: To analyse usage patterns and behaviour anonymously, helping improve the App’s performance, user interface, and features.</p>",
        "<p class=\"mb-4\">Personal data will never be used for purposes beyond those described here without prior consent from the user. The App adheres strictly to data protection principles to ensure that personal data is handled responsibly and transparently.</p>"
      ]
    },
    {
      "heading": "Sharing of Personal Data",
      "content": [
        "<p class=\"mb-4\">The App does not share your personal data with any third parties except as necessary to provide the service. Specifically, personal data is shared only with Firebase, which is used to store and manage your data securely.</p>",
        "<p class=\"mb-4\">No other third parties receive or process your personal information from the App. We do not sell, rent, or trade your personal data in any way.</p>"
      ]
    },
    {
      "heading": "Third-Party Services",
      "content": [
        "<p class=\"mb-4\">The App utilises Firebase as its backend service provider to handle authentication, data storage, and real-time database functions. Firebase processes personal data on our behalf according to their privacy policies and applicable laws. For more information, please review <a href=\"https://firebase.google.com/support/privacy\">Firebase’s Privacy Policy</A>.</p>",
        "<p class=\"mb-4\">Aside from Firebase, the App does not integrate or share data with any other third-party services.</p>"
      ]
    },
    {
      "heading": "Cookies and Other Technologies",
      "content": [
        "<p class=\"mb-4\">The App does not use cookies, tracking pixels, or similar technologies to collect personal data.</p>",
        "<p class=\"mb-4\">Some simple settings may be stored locally on your device to enhance usability, but these do not involve tracking or transmitting personal information.</p>"
      ]
    },
    {
      "heading": "International Data Transfers",
      "content": [
        "<p class=\"mb-4\">Your personal data is stored and processed on Firebase servers, which may be located outside of your country of residence.</p>",
        "<p class=\"mb-4\">We do not independently transfer personal data internationally; however, Firebase’s infrastructure may involve cross-border data processing in compliance with applicable privacy laws and safeguards.</p>"
      ]
    },
    {
      "heading": "Data Retention & Storage",
      "content": [
        "<p class=\"mb-4\">The App retains personal and community data only for as long as necessary to provide core functionality and support the community purpose of the platform.</p>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Personal Data</h3></p>",
        "<p class=\"mb-4\">Personal data such as email addresses, usernames, and UIDs are retained while the user account remains active. Users may delete their account at any time, at which point:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>The user’s authentication credentials are removed from Firebase Authentication.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>The user’s personal settings and preferences are deleted.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>Any private, user-specific content (e.g. saved private locations) is deleted.</li>",
        "</ul>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Community Data</h3></p>",
        "<p class=\"mb-4\">Community contributions (e.g. public locations and reviews) are designed to persist for the benefit of all users. When a user deletes their account:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Public locations</strong> they contributed will remain, but their username and UID will be removed. The locations will no longer be attributable to the original user.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Location titles</strong> (i.e. user-generated names for public locations) will be retained. While in rare cases these titles may include references that resemble personal information (e.g. “John Smith's Spot” or “Ben’s Secret Place”), they are not linked to any user once the associated account is deleted. As no identifiers are retained, and the App holds no means to re-identify individuals from these titles alone, the remaining data is considered anonymised and no longer constitutes personal data under applicable data protection laws.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Review content and locaton notes</strong> (e.g. free-text user-generated input) will be deleted entirely, as they may contain personal information. Only non-identifiable data or metadata such as numerical review scores or date will be retained.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Non-interacted content</strong> (e.g. public locations with no reviews or favourites) will not be deleted on the user's behalf.</li>",
        "</ul>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Users retain full control</strong> of their content while their account is active and may delete non-interacted locations or individual reviews at any time.</li>",
        "</ul>",
        "<div class=\"bg-gradient-to-r from-blue-50 to-indigo-50 border-l-4 border-blue-600 rounded-r-lg px-4 py-2 mb-4 shadow-sm\">",
        "<div class=\"flex items-start\">",
        "<div class=\"flex-shrink-0 mr-3\">",
        "<svg class=\"w-5 h-5 text-blue-500 mt-0.5\" fill=\"currentColor\" viewBox=\"0 0 20 20\">",
        "<path fill-rule=\"evenodd\" d=\"M18 10a8 8 0 11-16 0 8 8 0 0116 0zm-7-4a1 1 0 11-2 0 1 1 0 012 0zM9 9a1 1 0 000 2v3a1 1 0 001 1h1a1 1 0 100-2v-3a1 1 0 00-1-1H9z\" clip-rule=\"evenodd\"></path>",
        "</svg>",
        "</div>",
        "<div class=\"flex-1\">",
        "<p class=\"text-gray-800 font-medium leading-tight mb-0\"><strong>Notes:</strong> Users are advised to review and manage any content they wish to remove before deleting their account. Once an account is deleted, all personal identifiers will be removed and recovery of the original user’s data will no longer be possible.</p>",
        "</div>",
        "</div>",
        "</div>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Community Value and Data Retention</h3></p>",
        "<p class=\"mb-4\">This policy ensures that community contributions, once engaged with by others, continue to provide value while respecting user privacy and aligning with data protection principles, even after the original contributor has left the platform.</p>"
      ]
    },
    {
      "heading": "Protection of Personal Data",
      "content": [
        "<p class=\"mb-4\">The App takes reasonable technical and organisational measures to protect personal data against unauthorised access, alteration, disclosure, or destruction.</p>",
        "<p class=\"mb-4\">All user authentication and data storage functions are handled by Firebase, which applies robust security practices, including data encryption in transit and at rest. Access to personal data within Firebase is restricted by security rules that limit access to only the relevant authenticated user or specific application logic.</p>",
        "<p class=\"mb-4\">Locally stored data (such as lightweight user preferences) is stored using secure system APIs provided by the device's operating system.</p>",
        "<p class=\"mb-4\">While no system can guarantee complete security, we are committed to maintaining appropriate safeguards and reviewing our security practices regularly.</p>"
      ]
    },
    {
      "heading": "Your Privacy Rights & Choices",
      "content": [
        "<p class=\"mb-4\">The App respects your rights over your personal data. As a user, you have the following rights:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Access</strong>: You can request access to the personal data we hold about you, including information associated with your UID, email address, and contributions.</li>",
        "<li><strong>Correction</strong>: You can update your username and editable profile information within the App, subject to reasonable limitations (i.e. username changes may be restricted in frequency to prevent abuse or excessive cost).</li>",
        "<li><strong>Deletion</strong>: You may delete your account at any time through the App’s settings. Upon deletion, your personal data will be removed or anonymised as outlined in the <a href=\"#data-retention\" class=\"text-primary hover:text-blue-600 underline\">Data Retention</a> section.</li>",
        "</ul>",
        "<p class=\"mb-4\">To exercise any of these rights, or to ask questions about your data, please contact us at the address listed in the <a href=\"#contact-us\" class=\"text-primary hover:text-blue-600 underline\">Contact Us</a> section. We will respond to all requests within a reasonable timeframe and in accordance with applicable laws.</p>",
        "<p class=\"mb-4\">Please note that certain data may be retained where necessary for legitimate purposes such as legal compliance, fraud prevention, or the protection of community content.</p>"
      ]
    },
    {
      "heading": "Children & Privacy",
      "content": [
        "<p class=\"mb-4\">The App is not specifically directed at children and does not knowingly collect personal data from users under the age of 13 (or the applicable age of digital consent in your jurisdiction). We do not request or record users’ ages and therefore cannot determine definitively who is a child.</p>",
        "<p class=\"mb-4\">While the App’s intended content is respectful and community-friendly, it includes user-generated contributions such as location notes and reviews. As such, there is a possibility that some content may not be suitable for children.</p>",
        "<p class=\"mb-4\">We encourage parents or guardians to supervise the use of the App by children or younger users, particularly when interacting with user-generated content. If inappropriate content is identified, users can flag it for review, and we will take reasonable steps to remove material that violates our guidelines. However, we cannot guarantee that all content will be child-safe at all times.</p>",
        "<p class=\"mb-4\">If we become aware that personal data has been collected from a child without appropriate consent, we will take prompt steps to delete that data.</p>"
      ]
    },
    {
      "heading": "Changes to This Policy",
      "content": [
        "<p class=\"mb-4\">We may update this Privacy Policy from time to time to reflect changes in our practices, legal requirements, or improvements to the App. When we make significant changes, we will notify users by updating the date at the top of this policy and, where appropriate, providing additional notice within the App.</p>",
        "<p class=\"mb-4\">We encourage you to review this Privacy Policy periodically to stay informed about how we protect your information. Continued use of the App after changes have been made constitutes your acceptance of the updated policy.</p>",
        "<p class=\"mb-4\">If you have any questions about changes to this Privacy Policy, please contact us using the details provided in the Contact Us section.</p>"
      ]
    },
    {
      "heading": "Contact Us",
      "content": [
        "<p class=\"mb-4\">If you have questions about this policy or your data, please contact:</p>",
        "<p class=\"mb-4\"><strong>Email:</strong> <a href=\"mailto:hello@cumuluscoding.com?subject=SlackMap%20-%20Your%20Subject\" class=\"text-primary hover:text-blue-600 underline\">hello@cumuluscoding.com</a></p>",
        "<p class=\"mb-4\">When emailing us, please include the app name first, followed by your subject in the email's subject line.</p>",
        "<p class=\"mb-4\">For example: <code class='bg-gray-100 px-1 py-0.5 rounded text-sm'>SlackMap - [Your Subject Here]</code></p>"
      ]
    }
  ],
  "metadata": {
    "version": "1.0.0",
    "lastUpdated": "2025-09-10",
    "effectiveDate": "2025-09-10",
    "locale": "en-GB"
  }
}
