{
  "appId": "trail-pacing",
  "title": "Privacy Policy (Trail Pacing)",
  "sections": [
    {
      "heading": "TL;DR (Too Long; Didn’t Read)",
      "content": [
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>The app uses your <strong>location</strong> to measure distance and trigger interval notifications while you hike.</li>",
        "<li><strong>Health data is optional</strong>. If you allow it, TrailPacing can read <strong>Step Count</strong> and <strong>Active Energy</strong> (kilocalories) to enhance session stats.</li>",
        "<li><strong>No accounts, no servers, no analytics, no ads.</strong> Processing happens on your device.</li>",
        "<li>We <strong>don’t sell or share</strong> your data with third parties.</li>",
        "<li>You can change permissions at any time in <strong>iOS Settings</strong> (Location/Notifications/Health)</li>",
        "<li>Deleting the app removes the app’s data stored on your device.</li>",
        "</ul>"
      ]
    },
    {
      "heading": "Introduction",
      "content": [
        "<p class=\"mb-4\">This Privacy Policy explains how <strong>TrailPacing</strong> (“the App”, “we”, “us”) handles your personal data when you use the App. TrailPacing supports outdoor navigation skills by tracking distance and providing interval notifications. We collect and process <strong>the minimum data necessary</strong>, keep processing <strong>on-device</strong>, and are transparent about your <strong>choices</strong>.</p>",
        "<p class=\"mb-4\">If you do not agree with this policy, please do not use the App.</p>"
      ]
    },
    {
      "heading": "Collection of Personal Data",
      "content": [
        "<p class=\"mb-4\">We may process the following data categories:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Location data (on-device):</strong> GPS-derived data used to calculate distance, intervals, pace and elevation-related metrics during an active session.</li>",
        "<li><strong>Health data (optional, on-device):</strong> If you grant permission, we read <strong>Step Count</strong> and <strong>Active Energy</strong> (kilocalories) to display “this session” metrics. We do <strong>not</strong> write Health data.</li>",
        "<li><strong>Device settings & preferences (on-device):</strong> Your chosen interval size, UI preferences (e.g., stat cards), and notification settings. Stored in <strong>UserDefaults</strong>.</li>",
        "<li><strong>Notifications:</strong> We schedule <strong>local notifications</strong> on your device to alert you at distance intervals.</li>",
        "</ul>",
        "<p class=\"mb-4\">We do <strong>not</strong> collect names, emails, account identifiers, advertising IDs, or other direct identifiers beyond what iOS permission systems require.</p>"
      ]
    },
    {
      "heading": "Use of Personal Data",
      "content": [
        "<p class=\"mb-4\">We use data <strong>solely on your device</strong> to:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>Provide core features: distance measurement, interval notifications, live stats (speed, average pace, elevation), and optional session effort indicators (steps/active energy).</li>",
        "<li>Remember your preferences (intervals, stat cards, permission prompts).</li>",
        "</ul>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Legal basis (EEA/UK users)</h3></p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Location and notifications:</strong> Necessary to provide the requested features (performance of a contract / legitimate interests).</li>",
        "<li><strong>Health data:</strong> <strong>Explicit consent</strong> via the Settings app. You can withdraw consent at any time.</li>",
        "</ul>",
        "<p class=\"mb-4\"><strong>Automated decisions:</strong> We do <strong>not</strong> use automated decision-making or profiling in any way that has <strong>legal or similarly significant effects</strong> on you.</p>"
      ]
    },
    {
      "heading": "Sharing of Personal Data",
      "content": [
        "<p class=\"mb-4\">We <strong>do not sell</strong> your personal data. We <strong>do not share</strong> your personal data with advertisers or data brokers. Processing occurs on your device. We do not operate back-end servers for this App.</p>"
      ]
    },
    {
      "heading": "Third-Party Services",
      "content": [
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Apple Health (HealthKit):</strong> If enabled, the App reads Step Count and Active Energy to display session metrics. Health data is handled in accordance with Apple’s developer terms. We <strong>do not</strong> use Health data for advertising, we <strong>do not</strong> share it with third parties, and we <strong>do not</strong> write Health data.</li>",
        "<li><strong>Apple frameworks:</strong> Core Location, UserNotifications and other iOS components operate on your device under Apple’s platform rules.</li>",
        "<li><strong>Backups & diagnostics (platform-controlled):</strong> If you use iCloud backups or share device analytics with Apple, Apple’s services may process app data under Apple’s policies. We do not receive those diagnostics.</li>",
        "</ul>"
      ]
    },
    {
      "heading": "Cookies and Other Technologies",
      "content": [
        "<p class=\"mb-4\">TrailPacing is a native iOS application and <strong>does not use cookies</strong> or web trackers. We use local storage (<strong>UserDefaults</strong>) only to keep your preferences on-device.</p>"
      ]
    },
    {
      "heading": "International Data Transfers",
      "content": [
        "<p class=\"mb-4\">We do not transmit your personal data to our servers. As processing occurs on your device, there are <strong>no intentional international transfers</strong> by us. Any transfers performed by Apple services you enable (e.g., iCloud backups) are governed by Apple’s terms.</p>"
      ]
    },
    {
      "heading": "Data Retention & Storage",
      "content": [
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>On-device only.</strong> We store preferences in <strong>UserDefaults</strong> and process session data in memory during use. We do not maintain remote copies.</li>",
        "<li><strong>No long-term retention by us.</strong> Session metrics are ephemeral unless you save them within the App (if/when such a feature is enabled).</li>",
        "<li><strong>Deletion.</strong> Deleting the App removes the App’s stored data from your device. You can also revoke Health and Location permissions at any time.</li>",
        "</ul>"
      ]
    },
    {
      "heading": "Protection of Personal Data",
      "content": [
        "<p class=\"mb-4\">We apply reasonable <strong>technical and organisational measures</strong> appropriate to this App’s minimal, on-device processing, including:</p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li>Processing on-device within the iOS sandbox; no external transmission by us.</li>",
        "<li>Using iOS <strong>permission controls</strong> for Location, Notifications and Health data access.</li>",
        "<li>Data minimisation: we collect only what the feature needs and keep it only as long as necessary.</li>",
        "</ul>",
        "<p class=\"mb-4\">No method of electronic processing is 100% secure, but we work to reduce risks through minimal collection and on-device processing.</p>"
      ]
    },
    {
      "heading": "Your Privacy Rights & Choices",
      "content": [
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Your legal rights (EEA/UK and similar jurisdictions)</h3></p>",
        "<p class=\"mb-4\">Subject to local law, you may have rights to <strong>access</strong>, <strong>rectify</strong>, <strong>erase</strong>, <strong>restrict</strong> or <strong>object</strong> to processing, and <strong>portability</strong>. Because we do not operate a server or maintain user accounts, these rights generally relate to data stored on your device. Contact us if you need assistance exercising your rights.</p>",
        "<p class=\"mb-4\"><h3 class=\"text-lg font-medium text-gray-900 mt-4 mb-2\">Your choices in iOS and the App</h3></p>",
        "<ul class=\"list-disc list-outside mb-4 space-y-1 pl-5\">",
        "<li><strong>Health data (Steps/Active Energy):</strong> Enable or revoke at any time via <strong>Settings → Privacy & Security → Health → TrailPacing</strong>.</li>",
        "<li><strong>Location:</strong> Change at any time in <strong>Settings → Privacy & Security → Location Services → TrailPacing</strong>.</li>",
        "<li><strong>Notifications:</strong> Manage in <strong>Settings → Notifications → TrailPacing</strong>.</li>",
        "<li><strong>In-app preferences:</strong> Adjust interval size and stat cards in the App’s settings.</li>",
        "</ul>",
        "<p class=\"mb-4\">Withdrawing a permission may limit related features.</p>"
      ]
    },
    {
      "heading": "Children & Privacy",
      "content": [
        "<p class=\"mb-4\">The App is <strong>not directed to children</strong> and is intended for general audiences. We do not knowingly collect personal data from children. If you believe a child has provided Health permissions or used the App inappropriately, please revoke permissions and delete the App, and contact us so we can assist.</p>"
      ]
    },
    {
      "heading": "Changes to This Policy",
      "content": [
        "<p class=\"mb-4\">We may update this policy from time to time. Changes will be reflected by the “Last updated” date at the top.</p>"
      ]
    },
    {
      "heading": "Contact Us",
      "content": [
        "<p class=\"mb-4\">If you have questions about this policy or your data, please contact:</p>",
        "<p class=\"mb-4\"><strong>Email:</strong> <a href=\"mailto:hello@cumuluscoding.com?subject=Trail%20Pacing%20-%20Your%20Subject\" class=\"text-primary hover:text-blue-600 underline\">hello@cumuluscoding.com</a></p>"
      ]
    }
  ],
  "metadata": {
    "version": "1.0.0",
    "lastUpdated": "2025-08-28",
    "effectiveDate": "2025-08-28",
    "locale": "en-GB"
  }
}
