{
  "shortDescription": "A nutrition database built on scientific data. Explore detailed nutrient information for thousands of foods with customisable settings to match your needs.",
  "longDescription": "<p class='mb-4'>Food Nutrient Profiles — a nutrition database built on scientific data. Explore detailed nutrient information for thousands of foods, with customisable settings to match your needs.</p><p class='mb-4'><strong>Comprehensive Food Database</strong></p><p class='mb-4'>Browse and search thousands of foods with complete nutrient profiles, including macronutrients, minerals, and vitamins. Search by category, nutrient content, cooking method, food state, source, or preparation style.</p><p class='mb-4'><strong>Scientific Foundation</strong></p><p class='mb-4'>Data comes from McCance and Widdowson's Composition of Foods Integrated Dataset (CoFID) 2021, maintained by Public Health England. Values are derived from direct analysis of foods purchased from UK retail outlets, analytical surveys, scientific literature, and published food composition tables. All values are expressed per 100g for easy comparison.</p><p class='mb-4'><strong>Intelligent Nutrient Ratings</strong></p><p class='mb-4'>See at a glance whether a food is high, medium, or low in specific nutrients. Ratings are based on daily reference values and can be customised to your needs.</p><p class='mb-4'><strong>Fully Customisable</strong></p><ul class='list-disc list-inside mb-4 space-y-2'><li>Choose daily reference values from UK, USA, EU, or an average</li><li>Adjust rating thresholds globally or per nutrient</li><li>Set your age and sex for personalised recommendations</li><li>Configure individual nutrient settings for fine control</li><li>Set diet preferences to highlight relevant information</li></ul><p class='mb-4'><strong>Detailed Information</strong></p><p class='mb-4'>View complete nutrient breakdowns, serving size calculations, nutrient definitions, and a data guide explaining how values are derived and used.</p><p class='mb-4'>Whether you're tracking nutrition, planning meals, or researching food composition, Food Nutrient Profiles provides accurate, science-based information in an easy-to-use format.</p>"
}

